Revit 2026 API

# RebarTrimExtendDataAddBarGeometry(CurveLoop) Method

---

Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarFreeFormValidationResult AddBarGeometry(
	CurveLoop curves
)
```
```vb
Public Function AddBarGeometry (
	curves As CurveLoop
) As RebarFreeFormValidationResult
```
```cpp
public:
RebarFreeFormValidationResult AddBarGeometry(
	CurveLoop^ curves
)
```
```fsharp
member AddBarGeometry :
        curves : CurveLoop -> RebarFreeFormValidationResult
```

#### Parameters

curves CurveLoop
     Curves describing one bar in the set.

#### Return Value

RebarFreeFormValidationResult Returns Success if everything is ok, otherwise the failure reason.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Incorrect number of bar geometry. |

This function can fail due to following reasons:

  * CurveLoop is empty.
  * CurveLoop contains an unbounded curve.
  * A rebar constructed from curves can't be bent according to the bending radius.

#### Reference

RebarTrimExtendData Class

AddBarGeometry Overload

Autodesk.Revit.DB.Structure Namespace